ednieuw/ESP32Communications/Old/ESP32Arduino_CommV011/ESP32Arduino_CommV011.ino
 LEDstrip.begin();
 LEDstrip.setBrightness(16);  
 LedsOff();                                                                // Set initial brightness of LEDs  (0-255)  
 ShowLeds();
}


//--------------------------------------------                                                //
// CLOCK In- or decrease light intensity value i.e. Slope
//--------------------------------------------
void WriteLightReducer(int amount)
{
 int value = Mem.LightReducer + amount;                                                       // Prevent byte overflow by making it an integer before adding
 Mem.LightReducer = (byte) constrain(value,5, 250);                                           // Between 5 and 250
 sprintf(sptext,"Max brightness: %3d%%",Mem.LightReducer);
 Tekstprintln(sptext);
}
//--------------------------- Time functions --------------------------
 time_t now;
//--------------------------------------------------------------------
// TIME Initialize time system (DS3231 + NTP + internal RTC)
//--------------------------------------------------------------------
void InitTimeSystem(void)
{
  SetSystemTimeToCompileTime();                                                               //   CompileTime = DateTime(__DATE__, __TIME__);    
  DS3231Installed = IsDS3231I2Cconnected();
  sprintf(sptext, "External RTC module %s found", DS3231Installed ? "IS" : "NOT");
  Tekstprintln(sptext);
  if (DS3231Installed) RTCklok.begin();
  if (DS3231Installed && Mem.UseDS3231)
  {
    GetDS3231Time(false);
    SetSystemTime(mktime(&timeinfo));                                                         // Sync ESP32 RTC from DS3231
  }
  else if (Mem.NTPOn && WiFi.isConnected())
  {
    GetNTPtime(false);
    SetSystemTime(mktime(&timeinfo));                                                         // Sync ESP32 RTC from NTP
    if (DS3231Installed && Mem.UseDS3231) SetDS3231Time();                                    // Sync DS3231
  }
  else
  {
    time(&now);
    localtime_r(&now, &timeinfo);
  }
}

//--------------------------------------------                                                 
// TIME Set system time to compile time using RTCLIB
//--------------------------------------------
void SetSystemTimeToCompileTimeRTCLIB(void)
{
 DateTime CompileTime = DateTime(F(__DATE__), F(__TIME__));                                   // Store strings in flash memory
 struct timeval Tv = { .tv_sec = (time_t) CompileTime.unixtime(), .tv_usec = 0 };
 settimeofday(&Tv, NULL);
 sprintf(sptext, "System time set to compile time: %s %s", __DATE__, __TIME__);
 Tekstprintln(sptext);
}

//--------------------------------------------                                                 
// TIME Set system time to compile time using basic functions
//--------------------------------------------
void SetSystemTimeToCompileTime(void)
{
 struct tm Tm;
 time_t Now;
 
 const char* MonthNames = "JanFebMarAprMayJunJulAugSepOctNovDec";                             // Parse __DATE__ and __TIME__ macros
 char MonthStr[4];
 sscanf(__DATE__, "%d %s %d", &Tm.tm_mday, MonthStr,  &Tm.tm_year);                           // Parse "08 Nov 2025"
 sscanf(__TIME__, "%d:%d:%d", &Tm.tm_hour, &Tm.tm_min, &Tm.tm_sec);                           // Parse "14:30:45"
 Tm.tm_year -= 1900;                                                                          // Years since 1900
 Tm.tm_mon = (strstr(MonthNames, MonthStr) - MonthNames) / 3;                                 // Month 0-11
 Tm.tm_isdst = -1;                                                                            // Auto-determine DST
 Now = mktime(&Tm);                                                                           // Convert to time_t
 struct timeval Tv = { .tv_sec = Now, .tv_usec = 0 };
 settimeofday(&Tv, NULL);                                                                     // Set system time
 sprintf(sptext, "System time set to compile time: %s %s", __DATE__, __TIME__);
 Tekstprintln(sptext);
}

//--------------------------------------------------------------------
// TIME Get current time from best available source
//--------------------------------------------------------------------
time_t GetTijd(bool printit)
{
  if (Mem.UseDS3231 && DS3231Installed)     { GetDS3231Time(false);  }
  else if (Mem.NTPOn && WiFi.isConnected()) { getLocalTime(&timeinfo);  }
  else  {    time(&now);                      localtime_r(&now, &timeinfo);  }
  time_t t = mktime(&timeinfo);
  if (printit) PrintRTCTime();
  return t;
}

//--------------------------------------------------------------------
// NTP Return local time as RTClib DateTime
//--------------------------------------------------------------------
DateTime GetLocalDateTime(){ return DateTime(GetTijd(false));}

//--------------------------------------------------------------------
// NTP print the NTP time for the timezone set 
//--------------------------------------------------------------------
void GetNTPtime(bool printit)
{
  sntp_set_sync_mode(SNTP_SYNC_MODE_IMMED);  // Immediate sync mode
  sntp_restart();                            // Triggers a fresh sync
  getLocalTime(&timeinfo);
  if (printit) PrintNTPtime();
}

//--------------------------------------------------------------------
// NTP Print current local (NTP) time
//--------------------------------------------------------------------
void PrintNTPtime(void)
{
  getLocalTime(&timeinfo);
  PrintRTCTime();
}

//--------------------------------------------------------------------
// NTP print the NTP UTC time 
//--------------------------------------------------------------------
void PrintUTCtime(void)
{
  time(&now);
  struct tm* UTCtime = gmtime(&now);
  sprintf(sptext, "UTC: %02d:%02d:%02d %02d-%02d-%04d",
          UTCtime->tm_hour, UTCtime->tm_min, UTCtime->tm_sec,
          UTCtime->tm_mday, UTCtime->tm_mon + 1, UTCtime->tm_year + 1900);
  Tekstprint(sptext);
}

// //--------------------------------------------                                                //
// // DS3231 Init module  -moved to ->  void InitTimeSystem(void)
// //--------------------------------------------
// void InitDS3231Mod(void)
// {
//  DS3231Installed = IsDS3231I2Cconnected();                                                    // Check if DS3231 is connected and working   
//  sprintf(sptext,"External RTC module %s found", DS3231Installed?"IS":"NOT");
//  RTCklok.begin();     
//  Tekstprintln(sptext);                                                             
// }
//--------------------------------------------------------------------
// DS3231 check for I2C connection
// DS3231_I2C_ADDRESS (= often 0X68) = DS3231 module
//--------------------------------------------------------------------
bool IsDS3231I2Cconnected(void)
{
  for (byte i = 1; i < 120; i++)
  {
    Wire.beginTransmission(i);
    if (Wire.endTransmission() == 0 && i == DS3231_I2C_ADDRESS)
      return true;
  }
  return false;
}

//--------------------------------------------------------------------
// DS3231 temperature
//--------------------------------------------------------------------
float GetDS3231Temp(void)
{
  Wire.beginTransmission(DS3231_I2C_ADDRESS);
  Wire.write(0x11);
  Wire.endTransmission();
  Wire.requestFrom(DS3231_I2C_ADDRESS, 2);

  if (Wire.available())
  {
    byte tMSB = Wire.read();
    byte tLSB = Wire.read();
    return (tMSB & 0b01111111) + ((tLSB >> 6) * 0.25);
  }
  return -273.0;
}

//--------------------------------------------------------------------
// DS3231 RTC ESP32 -> DS3231
// Set time in module DS3231
//--------------------------------------------------------------------
void SetDS3231Time(void)
{
  DateTime tNow(timeinfo.tm_year + 1900, timeinfo.tm_mon + 1, timeinfo.tm_mday,
                timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec);
  RTCklok.adjust(tNow);
  Tekstprint("Time set in DS3231 RTC module: ");
  PrintDS3231Time();
  if(!Mem.UseDS3231 && !Mem.NTPOn ) Tekstprintln("*** Not using DS3231");
}

//--------------------------------------------------------------------
// DS3231 reads time in module DS3231
// and store it in Word clock time structure
//--------------------------------------------------------------------
void GetDS3231Time(bool printit)
{
  DateTime Inow = RTCklok.now();
  timeinfo.tm_year = Inow.year() - 1900;
  timeinfo.tm_mon  = Inow.month() - 1;
  timeinfo.tm_mday = Inow.day();
  timeinfo.tm_hour = Inow.hour();
  timeinfo.tm_min  = Inow.minute();
  timeinfo.tm_sec  = Inow.second();
  if (printit) PrintDS3231Time();
}

//--------------------------------------------------------------------
// DS3231 Print DS3231 time
//--------------------------------------------------------------------
void PrintDS3231Time(void)
{
 DateTime Inow = RTCklok.now();
 sprintf(sptext, "%02d/%02d/%04d %02d:%02d:%02d ",
          Inow.day(), Inow.month(), Inow.year(),
          Inow.hour(), Inow.minute(), Inow.second());
 Tekstprintln(sptext);
}

//--------------------------------------------                                                //
// RTC prints the ESP32 internal RTC time to serial
//--------------------------------------------
void PrintRTCTime(void)
{
 sprintf(sptext,"%02d/%02d/%04d %02d:%02d:%02d ", 
     timeinfo.tm_mday,timeinfo.tm_mon+1,timeinfo.tm_year+1900,
     timeinfo.tm_hour,timeinfo.tm_min,timeinfo.tm_sec);
 WTekstprint(sptext,"<!--"," -->");                                                         // Hide the time on the HTML page <!-- This text won't appear at all -->
 Tekstprintln("");
}

//--------------------------------------------                                                //
// RTC Fill sptext with time
//--------------------------------------------
void PrintTimeHMS(){ PrintTimeHMS(2);}                                                        // print with linefeed
void PrintTimeHMS(byte format)
{
 sprintf(sptext,"%02d:%02d:%02d",timeinfo.tm_hour,timeinfo.tm_min,timeinfo.tm_sec);
 switch (format)
 {
  case 0: break;
  case 1: Tekstprint(sptext); break;
  case 2: Tekstprintln(sptext); break;  
 }
}

//--------------------------------------------                                                //
// RTC Set time in ESP32 using global timeinfo struct
//--------------------------------------------
void SetRTCTime(void) 
{ 
 time_t t = mktime(&timeinfo);                                                                // t= unixtime
 SetSystemTime(t);
}

//--------------------------------------------                                                //
// RTC Set RTC time using Unix timestamp
//--------------------------------------------
void SetSystemTime(time_t t)
{ 
  struct timeval tv = { .tv_sec = t, .tv_usec = 0 };
  settimeofday(&tv, nullptr);
  localtime_r(&t, &timeinfo);
  Tekstprint("ESP32 RTC time set: ");
  PrintTimeHMS();
  Displaytime(); 
}

//--------------------------------------------                                                //
// CLOCK Print all the times available 
//--------------------------------------------
void PrintAllClockTimes(void)
{
 Tekstprint("\n Clock time: ");
 PrintRTCTime();
 if(WiFi.localIP()[0] != 0)                                                                   // If no WIFI then no NTP time printed
   {
    Tekstprint("   NTP time: ");
    PrintNTPtime();
   }
 if(DS3231Installed)
   {
    Tekstprint("DS3231 time: ");
    PrintDS3231Time();
   }
}
//--------------------------- End Time functions --------------------------

//--------------------------------------------                                                //
// BLE SendMessage by BLE Slow in packets of 20 chars
// or fast in one long string.
// Fast can be used in IOS app BLESerial Pro
//------------------------------
void SendMessageBLE(std::string Message)
{
 if(deviceConnected) 
   {
    if (Mem.UseBLELongString)                                                                 // If Fast transmission is possible
     {
      pTxCharacteristic->setValue(Message); 
      pTxCharacteristic->notify();
      delay(10);                                                                              // Bluetooth stack will go into congestion, if too many packets are sent
     } 
   else                                                                                       // Packets of max 20 bytes
     {   
      int parts = (Message.length()/20) + 1;
      for(int n=0;n<parts;n++)
        {   
         pTxCharacteristic->setValue(Message.substr(n*20, 20)); 
         pTxCharacteristic->notify();
         delay(10);                                                                           // Bluetooth stack will go into congestion, if too many packets are sent
        }
     }
   } 
}

//--------------------------------------------                                                //
// BLE Start BLE Classes NimBLE Version 2.x.x
//------------------------------
class MyServerCallbacks: public NimBLEServerCallbacks 
{
 void onConnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo) override 
    {deviceConnected = true; Serial.println("BLE Connected"      );}
 void onDisconnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo, int reason) override 
    {deviceConnected = false; Serial.println("BLE NOT Connected" );}
};
  
