ednieuw/ESP32Communications/Old/ESP32Arduino_CommV011/ESP32Arduino_CommV011.ino
// Handle the actual OTA upload
server.on("/update", HTTP_POST, [](AsyncWebServerRequest *request) {
    shouldReboot = true;
    request->send(200, "text/html", 
      "<!DOCTYPE html><html><body>"
      "<h2>Update successful. Rebooting...</h2>"
      "<p>You will be redirected shortly.</p>"
      "<script>setTimeout(()=>{location.href='/'}, 7000);</script>"
      "</body></html>");
  }, 
  [](AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
    if (!index) 
      {
       Serial.printf("OTA Start: %s\n", filename.c_str());
       if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { Update.printError(Serial);  }
      }
    if (Update.write(data, len) != len) { Update.printError(Serial);   }
    if (final) 
      {
       if (Update.end(true)) { Serial.printf("OTA Success: %u bytes\n", index + len);  } 
       else {Update.printError(Serial); }
      }
  });
 server.onNotFound(notFound);
 server.begin();
}


//--------------------------------------------                                                //
// WIFI WEBPAGE 
//--------------------------------------------
void notFound(AsyncWebServerRequest *request) 
{
  request->send(404, "text/plain", "Not found");
}

//--------------------------------------------                                                //
// WIFI WEBPAGE Login credentials Access Point page with 192.168.4.1
//--------------------------------------------
void StartAPMode(void) 
{
 WiFi.disconnect(true);                                                                      // Disconnect and erase old config
 apMode = true;
 Mem.WIFIcredentials = IN_AP_NOT_SET;
 StoreStructInFlashMemory(); 
 WiFi.softAP(AP_SSID, AP_PASSWORD);
 delay(100);
 dnsServer.start(53, "*", WiFi.softAPIP());
 Tekstprintln("\nConnect to StartWordcock in WIFI on your mobile.\nEnter password: wordclock\nThen in URL: 192.168.4.1 and enter router credentials");   
 server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
  { request->send(200,"text/html",SoftAP_html);  });
 server.on("/", HTTP_POST, [](AsyncWebServerRequest *request)
   {
    int params = request->params();
    for (int i = 0; i < params; i++) 
      {
       const AsyncWebParameter* p = request->getParam(i);
       if (p->name() == "ssid") { strcpy(Mem.SSID,p->value().c_str());       }
       if (p->name() == "pass") { strcpy(Mem.Password , p->value().c_str()); }
      }
    StoreStructInFlashMemory();
    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)                                  // Send web page with input fields to client
      { request->send(200, "text/plain", "Credentials saved. Restarting...");  } );  
    Mem.WIFIcredentials = SET;
    StoreStructInFlashMemory();  
    delay(300);
    ESP.restart();
   });

 server.begin();
 Serial.println("AP Mode Started");
 Serial.print("AP SSID: ");       Serial.println(AP_SSID);
 Serial.print("AP IP Address: "); Serial.println(WiFi.softAPIP()); 
}

//--------------------------------------------                                                //
// WIFI WPS functions
//--------------------------------------------
void wpsInitConfig()
{
 config.wps_type = ESP_WPS_MODE;
 strcpy(config.factory_info.manufacturer, ESP_MANUFACTURER);
 strcpy(config.factory_info.model_number, ESP_MODEL_NUMBER);
 strcpy(config.factory_info.model_name, ESP_MODEL_NAME);
 strcpy(config.factory_info.device_name, ESP_DEVICE_NAME);
}

void wpsStart()
{
 if(esp_wifi_wps_enable(&config))  Serial.println("WPS Enable Failed");
 else if(esp_wifi_wps_start(0)) 	 Serial.println("WPS Start Failed");
}

void wpsStop()
{
 if(esp_wifi_wps_disable()) 	     Serial.println("WPS Disable Failed");
}

String wpspin2string(uint8_t a[])
{
 char wps_pin[9];
 for(int i=0;i<8;i++){ wps_pin[i] = a[i]; }
 wps_pin[8] = '\0';
 return (String)wps_pin;
}
//--------------------------------------------                                                //
// End WPS
//--------------------------------------------


//--------------------------------------------                                                //
// KEYPAD 3x1 Init 
//--------------------------------------------
 void InitKeypad3x1(void)
 {
 digitalWrite(COLPIN,LOW);
 sprintf(sptext,"3*1 keypad %s used", Mem.UseRotary==2?"IS":"NOT");
 Tekstprintln(sptext);
 }
//--------------------------------------------
// KEYPAD check for Keypad input
//--------------------------------------------                           
void Keypad3x1Check(void)
{ 
 digitalWrite(COLPIN,LOW);                                                                    // Mimic a key press on pin 6 in order to select the first column
 char Key = keypad.getKey();
 if(Key)
  {
   Serial.println(Key);
   if (Key == 'Y')    ProcessKeyPressTurn(0);                                                 // Pressing Middle button Yellow activates the keyboard input.   
   else if (ChangeTime)    
     { 
      if (Key == 'R') ProcessKeyPressTurn(1);                                                 // Pressing Red increases hour or minute. 
      if (Key == 'G') ProcessKeyPressTurn(-1);                                                // Pressing Green decreases hour or minute. 
     }
   delay(200);
  }
} 
//--------------------------------------------                                                //
// KY-040 ROTARY encoder Init 
//--------------------------------------------
 void InitRotaryMod(void)
 {
 pinMode(encoderPinA,  INPUT_PULLUP);
 pinMode(encoderPinB,  INPUT_PULLUP);  
 pinMode(clearButton,  INPUT_PULLUP); 
 myEnc.write(0);                                                                              // Clear Rotary encoder buffer
 sprintf(sptext,"Rotary %s used", Mem.UseRotary==1?"IS":"NOT");
 Tekstprintln(sptext);   
 } 
//--------------------------------------------                                                //
// KY-040 ROTARY check if the rotary is moving
//--------------------------------------------
void RotaryEncoderCheck(void)
{
 int ActionPress = 999;
 if (digitalRead(clearButton) == LOW )          ProcessKeyPressTurn(0);                       // Set the time by pressing rotary button
 else if (ChangeTime || ChangeLightIntensity)    
  {   
   ActionPress = myEnc.read();                                                                // If the knob is turned store the direction (-1 or 1)
   if (ActionPress == 0) {  ActionPress = 999;  ProcessKeyPressTurn(ActionPress);  }          // Sent 999 = nop (no operation) 
   if (ActionPress == 1 || ActionPress == -1 )  ProcessKeyPressTurn(ActionPress);             // Process the ActionPress
  } 
 myEnc.write(0);                                                                              // Set encoder pos back to 0

if ((unsigned long) (millis() - RotaryPressTimer) > 60000)                                    // After 60 sec after shaft is pressed time of light intensity can not be changed 
   {
    if (ChangeTime || ChangeLightIntensity)                         
      {
        Tekstprintln("<-- Changing time is over -->");
        NoofRotaryPressed = 0;
      }
    ChangeTime            = false;
    ChangeLightIntensity  = false;
   }   
}

//--------------------------------------------                                                //
// CLOCK KY-040 Rotary or Membrane 3x1 processing input
// encoderPos < 1 left minus 
// encoderPos = 0 attention and selection choice
// encoderPos > 1 right plus
//--------------------------------------------
void ProcessKeyPressTurn(int encoderPos)
{
 if (ChangeTime || ChangeLightIntensity)                                                      // If shaft is pressed time of light intensity can be changed
   {
    if ( encoderPos!=999 && ( (millis() - Looptime) > 250))                                   // If rotary turned avoid debounce within 0.25 sec
     {   
     Serial.print(F("----> Index:"));   Serial.println(encoderPos);
     if (encoderPos == 1)                                                                     // Increase  
       {     
        if (ChangeLightIntensity)  { WriteLightReducer(5); }                                  // If time < 60 sec then adjust light intensity factor
        if (ChangeTime) 
          {
           if (NoofRotaryPressed == 1)                                                        // Change hours
              {if( ++timeinfo.tm_hour >23) { timeinfo.tm_hour = 0; } }      
           if (NoofRotaryPressed == 2)                                                        // Change minutes
              {  timeinfo.tm_sec = 0;
               if( ++timeinfo.tm_min  >59) 
                 { timeinfo.tm_min  = 0; if( timeinfo.tm_hour >=23) { timeinfo.tm_hour = 0; } }   
              }
           } 
        }    
      if (encoderPos == -1)                                                                   // Decrease
       {
       if (ChangeLightIntensity)   { WriteLightReducer(-5); }    // If time < 60 sec then adjust light intensity factor
       if (ChangeTime)     
          {
           if (NoofRotaryPressed == 1)                                                        // Change hours
             {if( timeinfo.tm_hour-- ==0)  { timeinfo.tm_hour = 23; }  }      
           if (NoofRotaryPressed == 2)                                                        // Change minutes
             { 
              timeinfo.tm_sec = 0;
              if( timeinfo.tm_min-- == 0) 
                { timeinfo.tm_min  = 59; if( timeinfo.tm_hour  == 0) { timeinfo.tm_hour = 23; } }
             } 
           }          
        } 
      SetDS3231Time();  
      PrintDS3231Time();
      Displaytime();      
      Looptime = millis();    
     }                                                     
   }
 if (encoderPos == 0 )                                                                        // Set the time by pressing rotary button
   { 
    delay(250);
    ChangeTime            = false;
    ChangeLightIntensity  = false;
    RotaryPressTimer      = millis();                                                         // Record the time the shaft was pressed.
    if(++NoofRotaryPressed > 9) NoofRotaryPressed = 0;
    switch (NoofRotaryPressed)                                                                // No of times the rotary is pressed
      {
       case 1:  ChangeTime = true;                                  break;                    // 
       case 2:  ChangeTime = true;                                  break;                    //        
       case 3:  ChangeLightIntensity = true;                        break;                    // 
       case 4:                                                      break;                    // 
       case 5:                                                      break;                    // 
       case 6:                                                      break;                    // 
       case 7:                                                      break;                    //                                
       case 8:                                                      break;
       case 9:  Reset();                                            break;                    // Reset all settings                                                                  
      default:                                                      break;                     
      }
    Serial.print(F("NoofRotaryPressed: "));   Serial.println(NoofRotaryPressed);   
    Looptime = millis();
    Displaytime(); 
   }
 }

//--------------------------------------------                                                //
// IR-RECEIVER Start alarge or tiny IR-RECEIVER 
// Copy the to be used ButtonNames for a small or large IR-receiver
//--------------------------------------------
void Start_IRreceiver(void)
{
 if (Mem.UseRotary==3) Init_IRreceiver(ButtonLNames, sizeof(ButtonLNames) / sizeof(ButtonLNames[0]));
 if (Mem.UseRotary==4) Init_IRreceiver(ButtonTNames, sizeof(ButtonTNames) / sizeof(ButtonTNames[0]));
}

//--------------------------------------------                                                //
// IR-RECEIVER Init
//--------------------------------------------
void Init_IRreceiver(String* ButtonTempNames, byte numButtons)
{
 ButtonNames = ButtonTempNames;  // Store pointer
 NOOFBUTTONS = numButtons;
 IrReceiver.begin(IRReceiverPin);

 if (Mem.UseRotary == 3 || Mem.UseRotary == 4)  {  GetIRRemoteFromFlashMemory(); }            // Load IR settings (only if IR remote is enabled)
 if (IRMem.remoteIdentified && IRMem.buttons[0].learned)                                      // Check if we already have learned buttons
  {
   learningMode = false;
   //PrintAllMappings();
   sprintf(sptext, "Remote identified - Protocol: %s", getProtocolString((decode_type_t) IRMem.learnedRemoteProtocol));
   Tekstprintln(sptext);
  }
}

//--------------------------------------------                                                //
// IR-RECEIVER Decode received signal,
// routes to learning or recognition mode and return code
//--------------------------------------------
uint16_t IrReceiverDecode(void)
{
 uint16_t command = 0; 
 if (IrReceiver.decode()) 
    {
                     command = IrReceiver.decodedIRData.command;
      uint16_t address       = IrReceiver.decodedIRData.address;
      decode_type_t protocol = IrReceiver.decodedIRData.protocol;
      if (!(IrReceiver.decodedIRData.flags & IRDATA_FLAGS_IS_REPEAT))                         // Ignore repeat codes
        {
         if (learningMode)  { ProcessLearningMode(protocol, command, address);  }
         else               { ProcessRecognitionMode(protocol, command, address);  }
        }
      delay(100);
      IrReceiver.resume();
    }
 return command;
}

//============================================
// IR-RECEIVER Internal function - Handles learning mode
// Validates remote matches, Saves when complete
//============================================
void ProcessLearningMode(decode_type_t protocol, uint16_t command, uint16_t address)
{
  // First button press - identify the remote control
  if (!IRMem.remoteIdentified)
  {
    IRMem.learnedRemoteAddress = address;
    IRMem.learnedRemoteProtocol = (uint8_t)protocol;
    IRMem.remoteIdentified = true;
    sprintf(sptext, "Remote identified - Protocol: %s, Address: 0x%04X", getProtocolString(protocol), address);
    Tekstprintln(sptext);
  }
  else
  {
    if (address != IRMem.learnedRemoteAddress || protocol != (decode_type_t)IRMem.learnedRemoteProtocol)    // Check if this is from the same remote
    {
      Tekstprintln("⚠ Wrong remote! Please use the same remote control.");
      sprintf(sptext, "Expected Address: 0x%04X, Got: 0x%04X", IRMem.learnedRemoteAddress, address);
      Tekstprintln(sptext);
      return;
    }
  }
  IRMem.buttons[currentLearningIndex].protocol = (uint8_t)protocol;                           // Store the button mapping
  IRMem.buttons[currentLearningIndex].command = command;
  IRMem.buttons[currentLearningIndex].address = address;
  IRMem.buttons[currentLearningIndex].learned = true;
  
  sprintf(sptext, "✓ Learned '%s' - Protocol: %s, Command: 0x%04X, Address: 0x%04X", 
          ButtonNames[currentLearningIndex].c_str(), getProtocolString(protocol), command, address);
  Tekstprintln(sptext);
  currentLearningIndex++;
  if (currentLearningIndex < NOOFBUTTONS)
  {
    sprintf(sptext, "\nPlease press button: %s", ButtonNames[currentLearningIndex].c_str());
    Tekstprintln(sptext);
  }
  else
  {
    learningMode = false;                                                                     // Learning complete
    StoreIRRemoteInFlashMemory();
    Tekstprintln("\n=== Learning Complete & Saved! ===");
    Tekstprintln("\nStored Button Mappings:");
    PrintAllMappings();
    Tekstprintln("\n=== Now in Recognition Mode ===");
    sprintf(sptext, "Only responding to remote with Address: 0x%04X", IRMem.learnedRemoteAddress);
    Tekstprintln(sptext);
    Tekstprintln("Press POWER to activate the remote.      = POWER ON");
    Tekstprintln("After 5 minutes remote auto powers down. = POWER OFF");         
    Tekstprintln("With POWER OFF the digits will change the Display choice");     
  }
}

//============================================
// IR-RECEIVER Internal function - handles recognition mode
// Validates remote address Calls RecognizeButton
//============================================
void ProcessRecognitionMode(decode_type_t protocol, uint16_t command, uint16_t address)
{
  if (address != IRMem.learnedRemoteAddress || 
     protocol != (decode_type_t) IRMem.learnedRemoteProtocol)                                 // Check if it's from the learned remote
  {
    sprintf(sptext, "⚠ Ignored - Wrong remote (Address: 0x%04X)", address);
    if (address!=0) Tekstprintln(sptext);                                                     // Stray input detected
  }
  else {RecognizeButton(protocol, command, address);  }                                       // Correct remote - identify which button was pressed
}

//--------------------------------------------                                                //
// IR-RECEIVER Initializes learning mode
// Resets all button data, Prompts for first button
//--------------------------------------------
void StartIRLearning()
{
 Tekstprintln("\n=== Starting Learning Mode ===");
 currentLearningIndex = 0;
 learningMode = true;
 IRMem.remoteIdentified = false;
 for (int i = 0; i < NOOFBUTTONS; i++) {IRMem.buttons[i].learned = false; }
 sprintf(sptext, "Please press button: %s", ButtonNames[0].c_str());
 Tekstprintln(sptext);
}

//--------------------------------------------                                                //
// IR-RECEIVER Shows learned buttons
//--------------------------------------------
void PrintAllMappings(void)
{
 if (!IRMem.remoteIdentified) {Tekstprintln("No remote learned yet!");  return; }
 PrintLine(35);
 sprintf(sptext, "IR-Remote Address: 0x%04X", IRMem.learnedRemoteAddress);
 Tekstprintln(sptext);
 sprintf(sptext, "IR-Remote Protocol: %s", getProtocolString( (decode_type_t) IRMem.learnedRemoteProtocol));
 Tekstprintln(sptext);
 PrintLine(35);
  for (int i = 0; i < NOOFBUTTONS; i++)
  {
   if (IRMem.buttons[i].learned)
    {
     sprintf(sptext, "%s\t-> Cmd: 0x%04X", ButtonNames[i].c_str(), IRMem.buttons[i].command);
     Tekstprintln(sptext);     
    }
  }
 PrintLine(35);
}

//--------------------------------------------                                                //
// IR-RECEIVER Reset all settings
//--------------------------------------------
void ResetAllIRremoteSettings()
{
 Tekstprintln("\n=== Resetting All IR remote Data ===");
 IRMem.remoteIdentified = false;
 IRMem.learnedRemoteAddress = 0;
 IRMem.learnedRemoteProtocol = 0;
 for (int i = 0; i < NOOFBUTTONS; i++)
  {
    IRMem.buttons[i].learned = false;
    IRMem.buttons[i].protocol = 0;
    IRMem.buttons[i].command = 0;
    IRMem.buttons[i].address = 0;
  }
  
  StoreIRRemoteInFlashMemory();
  Tekstprintln("✓ IR remote reset complete.");   
  learningMode = false;
}


//--------------------------------------------                                                //
// IR-RECEIVER Identifies button pressed
//--------------------------------------------
int RecognizeButton(decode_type_t protocol, uint16_t command, uint16_t address)
{
  bool found = false;
  for (int i = 0; i < NOOFBUTTONS; i++)
  {
    if (IRMem.buttons[i].learned && 
        IRMem.buttons[i].protocol == (uint8_t)protocol &&
        IRMem.buttons[i].command == command && 
        IRMem.buttons[i].address == address)
    {
      sprintf(sptext, "Button pressed: %s", ButtonNames[i].c_str());
      Tekstprintln(sptext);
      found = true;
      ReworkIRremoteValue(i);
      return i;
    }
  }
  
  if (!found)
  {
    sprintf(sptext, "Unknown button - Protocol: %s, Command: 0x%04X, Address: 0x%04X", getProtocolString(protocol), command, address);
    Tekstprintln(sptext);
    ReworkIRremoteValue(-1);
    return -1;
  } 
 return -1;
}

//--------------------------------------------                                                //
// IR-RECEIVER ReworkRemoteValue
// String ButtonNames[] = {"0", "1", "2", "3", "4", "5", "6", "7", "8", "9",
//                        "UP", "DOWN", "LEFT", "RIGHT", "POWER", "OK"};
//  Button "POWER" and "ONOFF" can work without POWER ON
//--------------------------------------------
void ReworkIRremoteValue(int ButtonNamesNr)
{
 String ButtonName = ButtonNames[ButtonNamesNr]; 
 String DisplayOption = "Q0";
 if (ButtonNamesNr == -1)  {Tekstprintln("Unknown button - ignored");  return;  }

