ednieuw/ESP32Communications/Old/ESP32Arduino_CommV011/ESP32Arduino_CommV011.ino
if (Mem.UseRotary == 3)
 {
 if (IR_PowerOnstate == false) // && ButtonNamesNr < 14 ) 
 {
 switch(ButtonNamesNr)
  {
    case 0: ReworkInputString("Q0");  break;                                                  // Button "0"
    case 1: ReworkInputString("Q1");  break;                                                  // Button "1"
    case 2: ReworkInputString("Q2");  break;                                                  // Button "2"
    case 3: ReworkInputString("Q3");  break;                                                  // Button "3"
    case 4: ReworkInputString("Q4");  break;                                                  // Button "4"
    case 5: ReworkInputString("Q5");  break;                                                  // Button "5"
    case 6: ReworkInputString("Q6");  break;                                                  // Button "6"
    case 7: ReworkInputString("Q7");  break;                                                  // Button "7"
    case 8: ReworkInputString("Q8");  break;                                                  // Button "8"
    case 9: ReworkInputString("Q9");  break;                                                  // Button "9"                                               // Turn displaychoice on
    case 10:                                                                                  // Button "UP"
    case 11:                                                                                  // Button "DOWN"
    case 12:                                                                                  // Button "LEFT"
    case 13:                                                                                  // Button "RIGHT"
            break;
    case 14:                                                                                  // Button "POWER"
            ToggleIRpower();
            break;
    case 15:                                                                                  // Button "OK"
            break;
    case 16:                                                                                  // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            sprintf(sptext, "Button '%s' not yet assigned", ButtonName.c_str());
            Tekstprintln(sptext);
            break;
  }
 }
 else
 {
 switch(ButtonNamesNr)
  {
    case 0 ... 9:                                                                                   // Button "0 - 9"
            EnteredDigits += ButtonName;                                                      // Add digit to entered string  
            if (EnteredDigits.length() > 6) {EnteredDigits = EnteredDigits.substring(0, 6); } // Limit to 6 digits (HHMMSS)
            if (EnteredDigits.length() == 6)
              {
               sprintf(sptext, "Time entered: %c%c:%c%c:%c%c (press OK)", 
                 EnteredDigits[0], EnteredDigits[1], EnteredDigits[2], 
                 EnteredDigits[3], EnteredDigits[4], EnteredDigits[5]);
              }
            else sprintf(sptext, "Digits: %s (Need 6 for HHMMSS)", EnteredDigits.c_str());
            Tekstprintln(sptext);
            break;
    case 10:                                                                                  // Button "UP"
            AdjustTime(1, 0, 0);                                                              // +1 hour
            break;
    case 11:                                                                                  // Button "DOWN"
            AdjustTime(-1, 0, 0);                                                             // -1 hour
            break;
    case 12:                                                                                  // Button "LEFT"
            AdjustTime(0, -1, 0);                                                             // -1 minute
            break;
    case 13:                                                                                  // Button "RIGHT"
            AdjustTime(0, 1, 0);                                                              // +1 minute
            break;
    case 14:                                                                                  // Button "POWER"
            ToggleIRpower();
            break;
    case 15: 
            learningMode = false;                                                             // Button "OK"
//          Serial.println(EnteredDigits.length());   
            if (EnteredDigits.length() == 6) {ReworkInputString(EnteredDigits); EnteredDigits = "";}
            else  { Tekstprintln("⚠ Need 6 digits (HHMMSS) before OK");  }
            break;
    case 16:                                                                                  // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            sprintf(sptext, "Button '%s' not yet assigned", ButtonName.c_str());
            Tekstprintln(sptext);
            break;
  }
 }
 }  // end if ==3

if (Mem.UseRotary == 4)                                                                      // {"MIN-1", "MIN+1","UUR-1","UUR+1","POWER","ONOFF"};
 {
 if (IR_PowerOnstate == false) // && ButtonNamesNr < 14 ) 
 {
 switch(ButtonNamesNr)
    {
    case 4:                                                                                   // Button "POWER"
            ToggleIRpower();
            break;
    case 5:                                                                                   // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            Tekstprintln("Turn On remote with POWER");
            break;
    }
  }
 else
   {
    switch(ButtonNamesNr)
     {
    case 0:                                                                                   // Button "MIN-1"
            AdjustTime(0, -1, 0);                                                             // -1 minute
            break;
    case 1:                                                                                   // Button "MIN+1"
            AdjustTime(0, 1, 0);                                                              // +1 minute
            break;
    case 2:                                                                                   // Button "UUR-1"
            AdjustTime(-1, 0, 0);                                                             // -1 hour
            break;
    case 3:                                                                                   // Button "UUR+1"
            AdjustTime(1, 0, 0);                                                              // +1 hour
            break;
    case 4:                                                                                   // Button "POWER"
            ToggleIRpower();
            break;
    case 5:                                                                                   // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            sprintf(sptext, "Button '%s' not yet assigned", ButtonName.c_str());
            Tekstprintln(sptext);
            break;
      }
   }
 } // end if ==4
}

//--------------------------------------------                                                //
// IR-RECEIVER Adjust current time by hours/minutes/seconds
//--------------------------------------------
void AdjustTime(int DeltaHours, int DeltaMinutes, int DeltaSeconds)
{
 timeinfo.tm_hour += DeltaHours;
 timeinfo.tm_min  += DeltaMinutes;
 timeinfo.tm_sec  += DeltaSeconds;
 //time_t t = 
 mktime(&timeinfo);
 if(DS3231Installed)   SetDS3231Time();
 Displaytime();       
}

//--------------------------------------------                                                //
// IR-RECEIVER Turn On or off Remote control
// Turns off after 60 seconds
//--------------------------------------------
void ToggleIRpower()
{
 static bool powerState = false;                                                              //
 powerState = !powerState;
 if (powerState)
  {
   IR_PowerOnstate = true;                                                                    // React on IR-remote input
   Tekstprintln("IR-remote is ON");
   IR_StartTime = millis();
  }
 else
  {
    Tekstprintln("IR-remote is OFF");
    IR_PowerOnstate = false;                                                                  // Do not react on IR-remote input
  } 
}